package five

// lesson 1

// Какие числа называют натуральными. Что такое классы и разряды.
// Натуральные числа это числа состоящие из цифр от 0 до 9

// lesson 2

// Как сравнивать натуральные числа. Как округлять натуральные числа.

// lesson 3

// Как складывать и вычитать натуральные числа. Законы сложения.

// Переместительный и сочетательный закон.

// lesson 4

// Как решать текстовые задачи на сложение и вычитание.

// lesson 5

// Что такое числовое выражение. Буквенные выражения и их значения. Формулы.

// lesson 6

// Как решать уравнения. Решение текстовых задач с помощью уравнений.

// lesson 7

// Как умножать и делить натуральные числа. Свойства умножения.

// 48 * 25 = (12 * 4) * 25 = 12 * 100 = 1200
// 32 * 125 * 18 = 4 * 8 * 125 * 18 = 4 * 1000 * 18 = 4000 * (10 + 8) = 40000 + 32000 = 72 000
// 32 * 125 * 18 = 4 * 8 * 125 * 18 = (8*125)*(4*18) = 1000 * 72 = 72000
// (9x-2x):9=14
// 7x=126
// x=18
// 9*(152-7y)=927
// 9 * 152 - 9 * 7Y = 927
// 9 * 152 - 927 = 9 * 7Y
// 1368 - 927 = 9 * 7Y
// 441 = 9 * 7Y
// 441 : 9 = 7Y
// 49 = 7Y
// Y = 49 : 7 = 7
