package five

// lesson 1

// Какие числа называют натуральными. Что такое классы и разряды.
// Натуральные числа это числа состоящие из цифр от 0 до 9

// lesson 2

// Как сравнивать натуральные числа. Как округлять натуральные числа.

// lesson 3

// Как складывать и вычитать натуральные числа. Законы сложения.

// Переместительный и сочетательный закон.

// lesson 4

// Как решать текстовые задачи на сложение и вычитание.

// lesson 5

// Что такое числовое выражение. Буквенные выражения и их значения. Формулы.

// lesson 6

// Как решать уравнения. Решение текстовых задач с помощью уравнений.
